GCSE/Computing_Fundamentals/pages/3-1-9-Algorithms-Practice.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>3.1.9-Algorithms Practice</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">3.1.9-Algorithms Practice</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Try These</a>
<ul>
<li><a href="#sec-1-1">Try It - Easy</a></li>
<li><a href="#sec-1-2">Try It - Medium</a></li>
<li><a href="#sec-1-3">Try It - Hard</a></li>
<li><a href="#sec-1-4">Try It - Very Hard</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class=ribbon>
<a href="GITHUB URL HERE">Fork me on GitHub</a>
</div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Try These</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 try">
<h3 id="sec-1-1">Try It - Easy</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Write an algorithm using pseudocode or a flowchart that will calculate the amount of fuel a plane needs to make a complete journey. The algorithm must:
</p>
<ul class="org-ul">
<li>Ask the user how many miles the journey will be.
</li>
<li>Ensure the answer is greater than 0
</li>
<li>Multiply the distance to be travelled by 20, to find the minimum number of litres required.
</li>
<li>Add 20% to the volume to handle holding patterns while waiting to land and detours.
</li>
<li>Report the volume required back to the user.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 try">
<h3 id="sec-1-2">Try It - Medium</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Write an algorithm using pseudocode or a flowchart that will calculate if a person has a healthy weight. The algorithm must:
</p>
<ul class="org-ul">
<li>Ask the user for their mass in kilograms.
</li>
<li>Ask the user for their height in metres.
</li>
<li>Ensure that both values are above 0
</li>
<li>Divide the mass by the height squared.
</li>
<li>If the BMI is between 18.5 and 25, it should report that they are of a healthy weight, otherwise it should report that they are underweight (lower) or overweight higher)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 try">
<h3 id="sec-1-3">Try It - Hard</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Write an algorithm using pseudocode or a flowchart that will calculate the resistance of a resistor. The algorithm must:
</p>
<ul class="org-ul">
<li>Ask the user for the colours of the first three bands on the resistor.
</li>
<li>If they don't enter a black, brown ,red, orange, yellow, green, blue, violet, grey or white it should ask them to enter a colour again.
</li>
<li>The first band should indicate the first digit of the resistance, with black being 0 up to white being 9.
</li>
<li>The second band should indicate the second digit of the resistance, with black being 0 up to white being 9.
</li>
<li>The third band should indicate the number of 0s to be added to the end of the first two digits, with black being 0 up to 9 being white.
</li>
<li>The resistance should be reported back to the user.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 try">
<h3 id="sec-1-4">Try It - Very Hard</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Write an algorithm using pseudocode or a flowchart that will correctly identify a hydrocarbon:
</p>
<ul class="org-ul">
<li>Ask the user how many carbons are in the hydrocarbon and only accept numbers between 1 and 8
</li>
<li>Ask the user how many hydrogens are in the hydrocarbon and only accept numbers between the number of carbons x 2, the (number of carbons * 2) + 2 or the (number of carbons x 2) -2.
</li>
<li>The number of carbons indicates the prefix of the hydrocarbon name, according to the following table.
</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">Carbons</th>
<th scope="col" class="left">Prefix</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left">Meth</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left">Eth</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left">Prop</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left">But</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left">Pent</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left">Hex</td>
</tr>

<tr>
<td class="right">7</td>
<td class="left">Hept</td>
</tr>

<tr>
<td class="right">8</td>
<td class="left">Oct</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>The suffix is decided by the ratio of carbon to hydrogen.
</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Ratio</th>
<th scope="col" class="left">Suffix</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C<sub>n</sub>H<sub>2n+2</sub></td>
<td class="left">ane</td>
</tr>

<tr>
<td class="left">C<sub>n</sub>H<sub>2n</sub></td>
<td class="left">ene</td>
</tr>

<tr>
<td class="left">C<sub>n</sub>H<sub>2n-2</sub></td>
<td class="left">yne</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>So C<sub>3</sub>H<sub>8</sub> would be Propane, C<sub>3</sub>H<sub>6</sub> would be Propene and C<sub>3</sub>H<sub>4</sub> would be Propyne
</li>
<li>The name of the hydrocarbon should be reported back to the user.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
